app.org
#+TITLE: App Loom: DotCortex
#+DESCRIPTION: Binary app installers (kitty, calibre, deepctl)
#+AUTHOR: Mètsàtron
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* App manifest
Columns: NAME METHOD URL ROOT BIN_DIR LINK_MODE NOTE R1
- METHOD: how to install (curl_sh, curl_bash, tar_gz)
- ROOT: absolute or ~ path to app root, default ~/.local/NAME.app
- BIN_DIR: relative directory under ROOT containing executables, default bin
- LINK_MODE:
  - all   = symlink all executables from BIN_DIR into ~/.local/bin
  - main:NAME = symlink only that executable name from BIN_DIR
  - none  = do not create symlinks (for odd cases)
- NOTE/R1: method-specific extras; =tar_gz= accepts =sha256=<digest>=; prefix a field with =env:= to pass an environment assignment to curl-based installers

#+BEGIN_SRC text :tangle all/.app/manifest/apps.ssv
# ~/DotCortex/all/.app/manifest/apps.ssv
# NAME         METHOD     URL                                            ROOT                               BIN_DIR LINK_MODE   NOTE                                           R1

kitty          curl_sh    https://sw.kovidgoyal.net/kitty/installer.sh   ~/.local/kitty.app                    bin     all         ""                                             ""
calibre        curl_sh    https://download.calibre-ebook.com/linux-installer.sh  ~/.local/calibre.app  .       main:calibre install_dir=~/.local/calibre.app  isolated=y
deepctl        curl_sh    https://raw.githubusercontent.com/deepinfra/deepctl/main/install.sh  ~/.local/bin  .  none  env:DEEPCTL_INSTALL=~/.local/bin  ""
cursor-agent   curl_bash  https://cursor.com/install                     ~/.local/share/cursor-agent         versions none        ""                                             ""
maestro        tar_gz     https://github.com/subhangR/agent-maestro/releases/download/v0.1.0/maestro-linux-x64.tar.gz  ~/.local/share/maestro  .  all  sha256=40a6c7ac71547ed3a990ea35844ec7cb89728d9cfd16a5c7b1e7fa93e201758d  ""
# maestro-ui placeholder: upstream v0.1.0 does not publish the Linux desktop artifact yet.
# expected asset: https://github.com/subhangR/agent-maestro/releases/download/v0.1.0/maestro-desktop-linux-x64.AppImage
#+END_SRC

* Apply manifest
#+BEGIN_SRC bash :tangle all/.local/bin/app-apply :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/app-apply
set -euo pipefail

MAN="$HOME/DotCortex/all/.app/manifest/apps.ssv"
APP_ONLY="${APP_ONLY:-}"

if [ ! -f "$MAN" ]; then
  echo "No app manifest at $MAN"
  exit 0
fi

_emit_norm() {
  awk -v FS='[ \t]+' '
    function dequote(s){ return (s=="\"\"" ? "" : s) }
    $0 ~ /^[[:space:]]*#/ || NF==0 { next }
    {
      n1=$1; n2=$2; n3=$3; n4=$4; n5=$5; n6=$6; n7=$7; n8=$8;
      printf "%s|%s|%s|%s|%s|%s|%s|%s\n",
        dequote(n1),dequote(n2),dequote(n3),dequote(n4),
        dequote(n5),dequote(n6),dequote(n7),dequote(n8)
    }
  ' "$MAN"
}

expand_root() {
  local name="$1" root="$2"

  if [ -z "$root" ]; then
    printf '%s\n' "$HOME/.local/${name}.app"
  elif [ "${root:0:1}" = "~" ]; then
    printf '%s\n' "${root/#\~/$HOME}"
  else
    printf '%s\n' "$root"
  fi
}

meta_value() {
  local key="$1"
  shift

  local field
  for field in "$@"; do
    case "$field" in
      "$key"=*)
        printf '%s\n' "${field#*=}"
        return 0
        ;;
    esac
  done

  return 1
}

expand_env_assignment() {
  local assignment="$1" key value

  key="${assignment%%=*}"
  value="${assignment#*=}"

  case "$value" in
    '~')
      value="$HOME"
      ;;
    '~/'*)
      value="${value#\~}"
      value="$HOME$value"
      ;;
  esac

  printf '%s=%s\n' "$key" "$value"
}

collect_installer_fields() {
  INSTALLER_ENV=()
  INSTALLER_ARGS=()

  local field
  for field in "$@"; do
    [ -n "$field" ] || continue
    case "$field" in
      env:*=*)
        INSTALLER_ENV+=("$(expand_env_assignment "${field#env:}")")
        ;;
      *)
        INSTALLER_ARGS+=("$field")
        ;;
    esac
  done
}

sha256_file() {
  local path="$1"

  if command -v sha256sum >/dev/null 2>&1; then
    sha256sum "$path" | awk '{print $1}'
  else
    shasum -a 256 "$path" | awk '{print $1}'
  fi
}

install_tar_gz() {
  local name="$1" url="$2" root="$3" note="$4" r1="$5"
  local tmpdir archive expected_sha actual_sha

  root="$(expand_root "$name" "$root")"
  tmpdir="$(mktemp -d)"
  archive="$tmpdir/archive.tar.gz"

  echo ">> [$name] install via tar.gz: $url"
  curl -fL "$url" -o "$archive"

  expected_sha="$(meta_value sha256 "$note" "$r1" || true)"
  if [ -n "$expected_sha" ]; then
    actual_sha="$(sha256_file "$archive")"
    if [ "$actual_sha" != "$expected_sha" ]; then
      echo "!! [$name] sha256 mismatch: expected $expected_sha, got $actual_sha" >&2
      rm -rf "$tmpdir"
      return 1
    fi
  fi

  mkdir -p "$root"
  tar -xzf "$archive" -C "$root"
  rm -rf "$tmpdir"
}

# Generic per app symlink sync: link executables from ROOT/BIN_DIR into ~/.local/bin
sync_links_for_app() {
  local name="$1" root="$2" bindir="$3" linkmode="$4"
  local symlink_dir="$HOME/.local/bin"
  local bin_path target
  local symlink_real bin_real

  root="$(expand_root "$name" "$root")"

  [ -z "$bindir" ] && bindir="bin"
  bin_path="${root%/}/$bindir"

  [ -d "$bin_path" ] || {
    echo ">> [$name] no bin dir at $bin_path, skipping link sync"
    return 0
  }

  mkdir -p "$symlink_dir"
  symlink_real="$(readlink -f "$symlink_dir" 2>/dev/null || printf '%s\n' "$symlink_dir")"
  bin_real="$(readlink -f "$bin_path" 2>/dev/null || printf '%s\n' "$bin_path")"

  if [ "$bin_real" = "$symlink_real" ]; then
    echo ">> [$name] bin dir already on PATH at $bin_real, skipping link sync"
    return 0
  fi

  echo ">> [$name] syncing symlinks from $bin_path into $symlink_dir (mode=$linkmode)"

  # Remove any existing symlinks in ~/.local/bin that point into this app's bin dir
  find "$symlink_dir" -maxdepth 1 -type l | while read -r link; do
    target="$(readlink "$link" 2>/dev/null || true)"
    case "$target" in
      "$bin_path"/*)
        rm -f "$link"
        ;;
    esac
  done

  case "${linkmode:-all}" in
    all|"")
      # Link all executable entries in bin_path, including symlinks
      while IFS= read -r exe; do
        local base
        [ -x "$exe" ] || continue
        base="$(basename "$exe")"
        ln -sf "$exe" "$symlink_dir/$base"
      done < <(find "$bin_path" -maxdepth 1 \( -type f -o -type l \))
      ;;

    main:*)
      local main
      main="${linkmode#main:}"
      if [ -x "$bin_path/$main" ]; then
        ln -sf "$bin_path/$main" "$symlink_dir/$main"
      else
        echo ">> [$name] main '$main' not found in $bin_path"
      fi
      ;;

    none)
      # Intentionally no links
      ;;

    *)
      echo ">> [$name] unknown LINK_MODE '$linkmode', skipping linking"
      ;;
  esac
}

echo "== app apply =="

while IFS='|' read -r name method url root bindir linkmode note r1
do
  [ -n "$name" ] || continue
  [ -n "$APP_ONLY" ] && [ "$name" != "$APP_ONLY" ] && continue

  method="${method:-curl_sh}"

  case "$method" in
    curl_sh)
      if [ -z "$url" ]; then
        echo "!! [$name] curl_sh with empty URL, skipping"
      else
        echo ">> [$name] install via curl script: $url"
        collect_installer_fields "$note" "$r1"
        # Build the sh command with optional extra args from NOTE and R1
        cmd=(sh /dev/stdin)
        [ "${#INSTALLER_ARGS[@]}" -gt 0 ] && cmd+=("${INSTALLER_ARGS[@]}")
        if ! curl -L "$url" | env "${INSTALLER_ENV[@]}" "${cmd[@]}"; then
          echo "!! [$name] install failed"
        fi
      fi
      ;;

    curl_bash)
      if [ -z "$url" ]; then
        echo "!! [$name] curl_bash with empty URL, skipping"
      else
        echo ">> [$name] install via curl+bash script: $url"
        collect_installer_fields "$note" "$r1"
        cmd=(bash)
        [ "${#INSTALLER_ARGS[@]}" -gt 0 ] && cmd+=("${INSTALLER_ARGS[@]}")
        if ! curl -L "$url" | env "${INSTALLER_ENV[@]}" "${cmd[@]}"; then
          echo "!! [$name] install failed"
        fi
      fi
      ;;

    tar_gz)
      if [ -z "$url" ]; then
        echo "!! [$name] tar_gz with empty URL, skipping"
      else
        if ! install_tar_gz "$name" "$url" "$root" "$note" "$r1"; then
          echo "!! [$name] install failed"
        fi
      fi
      ;;

    ""|none)
      echo ">> [$name] method empty, skipping install, still syncing links if root exists"
      ;;

    *)
      echo ">> [$name] unknown method '$method', skipping install, still syncing links if root exists"
      ;;
  esac

  # Always attempt to sync links for this app according to manifest
  sync_links_for_app "$name" "$root" "$bindir" "$linkmode"

done < <(_emit_norm)

echo "Done."
#+END_SRC

* Health
#+BEGIN_SRC bash :tangle all/.local/bin/app-health :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/app-health
set -euo pipefail

MAN="$HOME/DotCortex/all/.app/manifest/apps.ssv"
APP_ONLY="${APP_ONLY:-}"

if [ ! -f "$MAN" ]; then
  echo "No app manifest at $MAN"
  exit 0
fi

_emit_norm() {
  awk -v FS='[ \t]+' '
    function dequote(s){ return (s=="\"\"" ? "" : s) }
    $0 ~ /^[[:space:]]*#/ || NF==0 { next }
    {
      n1=$1; n2=$2; n3=$3; n4=$4; n5=$5; n6=$6; n7=$7; n8=$8;
      printf "%s|%s|%s|%s|%s|%s|%s|%s\n",
        dequote(n1),dequote(n2),dequote(n3),dequote(n4),
        dequote(n5),dequote(n6),dequote(n7),dequote(n8)
    }
  ' "$MAN"
}

echo "== app health =="

while IFS='|' read -r name method url root bindir linkmode note r1
do
  [ -n "$name" ] || continue
  [ -n "$APP_ONLY" ] && [ "$name" != "$APP_ONLY" ] && continue

  # Expand root, derive defaults to mirror app-apply
  if [ -z "$root" ]; then
    root="$HOME/.local/${name}.app"
  elif [ "${root:0:1}" = "~" ]; then
    root="${root/#\~/$HOME}"
  fi

  [ -z "$bindir" ] && bindir="bin"
  bin_path="${root%/}/$bindir"

  if command -v "$name" >/dev/null 2>&1; then
    echo "[$name] in PATH at $(command -v "$name")"
  elif [ -x "$bin_path/$name" ]; then
    echo "[$name] installed at $bin_path/$name but not in PATH"
  elif [ -d "$root" ]; then
    echo "[$name] app root present at $root but binary '$name' not found in $bin_path"
  else
    echo "[$name] not found (no PATH entry, no app root at $root)"
  fi

done < <(_emit_norm)
#+END_SRC


* Makefile fragment for apps
#+BEGIN_SRC makefile :tangle all/.mk/app.mk :padline no
# ~/DotCortex/all/.mk/app.mk
.RECIPEPREFIX := |
SHELL := /bin/bash

.PHONY: app-apply app-health

app-apply:
| @chmod +x $(HOME)/.local/bin/app-apply 2>/dev/null || true
| $(HOME)/.local/bin/app-apply

app-health:
| @chmod +x $(HOME)/.local/bin/app-health 2>/dev/null || true
| $(HOME)/.local/bin/app-health
#+END_SRC
